run/porousPimpleFoam/cylinder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.05;

deltaT          0.01;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1;

functions
{
    volFieldValue1
    {
        // Mandatory entries (unmodifiable)
        type            volFieldValue;
        libs            (fieldFunctionObjects);
    
        // Mandatory entries (runtime modifiable)
        fields          (Tf Ts);
        operation       average;
        regionType      all;
    
        writeFields     true;
    }

    // checkEnergyConservation
    // {
    //     // Mandatory entries (unmodifiable)
    //     type            coded;
    //     libs            (fieldFunctionObjects);
    
    //     // Mandatory entries (runtime modifiable)
    //     fields          (Tf Ts);
    //     operation       average;
    //     regionType      all;
    
    //     // // Optional entries (runtime modifiable)
    //     // postOperation   none;
    //     // weightField     none;
    
    //     // // Optional (inherited) entries
    //     writeFields     true;
    //     // scalingFactor   1.0;
    //     // writePrecision  8;
    //     // writeToFile     true;
    //     // useUserTime     true;
    //     // region          region0;
    //     // enabled         true;
    //     // log             true;
    //     // timeStart       0;
    //     // timeEnd         1000;
    //     // executeControl  timeStep;
    //     // executeInterval 1;
    //     // writeControl    writeTime;
    //     // writeInterval   -1;
    // }
}

// ************************************************************************* //
